In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('titanic_train_data.csv')
print(df.head(10))
df.dtypes

   Unnamed: 0  PassengerId  Survived  Sex     Age      Fare  Pclass_1  \
0           0            1         0    1  0.2750  0.014151         0
1           1            2         1    0  0.4750  0.139136         1
2           2            3         1    0  0.3250  0.015469         0
3           3            4         1    0  0.4375  0.103644         1
4           4            5         0    1  0.4375  0.015713         0
5           5            6         0    1  0.3500  0.016510         0
6           6            7         0    1  0.6750  0.101229         1
7           7            8         0    1  0.0250  0.041136         0
8           8            9         1    0  0.3375  0.021731         0
9           9           10         1    0  0.1750  0.058694         0

   Pclass_2  Pclass_3  Family_size  Title_1  Title_2  Title_3  Title_4  Emb_1  \
0         0         1          0.1        1        0        0        0      0
1         0         0          0.1        1        0        0        0      1
2         0         1          0.0        0        0        0        1      0
3         0         0          0.1        1        0        0        0      0
4         0         1          0.0        1        0        0        0      0
5         0         1          0.0        1        0        0        0      0
6         0         0          0.0        1        0        0        0      0
7         0         1          0.4        0        0        1        0      0
8         0         1          0.2        1        0        0        0      0
9         1         0          0.1        1        0        0        0      1

   Emb_2  Emb_3
0      0      1
1      0      0
2      0      1
3      0      1
4      0      1
5      1      0
6      0      1
7      0      1
8      0      1
9      0      0

Unnamed: 0       int64
PassengerId      int64
Survived         int64
Sex              int64
Age            float64
Fare           float64
Pclass_1         int64
Pclass_2         int64
Pclass_3         int64
Family_size    float64
Title_1          int64
Title_2          int64
Title_3          int64
Title_4          int64
Emb_1            int64
Emb_2            int64
Emb_3            int64
dtype: object

In [3]:
age=df['Age']
age_sex=df[['Age','Sex']]
age.shape
age_sex.shape
type(age_sex)
type(age)

pandas.core.series.Series

In [4]:
above35=df[df['Age']>0.3]
above35

,Unnamed: 0,PassengerId,Survived,Sex,Age,Fare,Pclass_1,Pclass_2,Pclass_3,Family_size,Title_1,Title_2,Title_3,Title_4,Emb_1,Emb_2,Emb_3
1,1,2,1,0,0.4750,0.139136,1,0,0,0.1,1,0,0,0,1,0,0
2,2,3,1,0,0.3250,0.015469,0,0,1,0.0,0,0,0,1,0,0,1
3,3,4,1,0,0.4375,0.103644,1,0,0,0.1,1,0,0,0,0,0,1
4,4,5,0,1,0.4375,0.015713,0,0,1,0.0,1,0,0,0,0,0,1
5,5,6,0,1,0.3500,0.016510,0,0,1,0.0,1,0,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
783,783,784,0,1,0.3500,0.045771,0,0,1,0.3,1,0,0,0,0,0,1
784,784,785,0,1,0.3125,0.013761,0,0,1,0.0,1,0,0,0,0,0,1
785,785,786,0,1,0.3125,0.014151,0,0,1,0.0,1,0,0,0,0,0,1
789,789,790,0,1,0.5750,0.154588,1,0,0,0.0,1,0,0,0,1,0,0
790,790,791,0,1,0.3500,0.015127,0,0,1,0.0,1,0,0,0,0,1,0

In [5]:
class23=df[df['Pclass_3']]
class23

KeyError: "None of [Int64Index([1, 0, 1, 0, 1, 1, 0, 1, 1, 0,\n            ...\n            0, 1, 1, 1, 1, 1, 1, 0, 1, 0],\n           dtype='int64', length=792)] are in the [columns]"

In [ ]:
age_not_na=df[df['Age'].notna()]
age_not_na
df.iloc[1:7,4:10]='anonymous'

# SERIES

In [6]:
import pandas as pd
import numpy as np

In [7]:
labels=['a','b','c']
my_data = [10,20,30]
arr =  np.array(my_data)
d={'a':10,'b':20,'c':30}

In [8]:
pd.Series(data=my_data,index = labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [13]:
arr1= pd.Series(['ABHISHEK','SANTOSH','ASHA'],[1,2,3])

In [14]:
arr1[3]

'ASHA'

In [15]:
arr2= pd.Series(['ABHISHEK','SANTOSH','ASHA','CONTROL','OVER'],[1,2,3,4,5])

In [16]:
arr2

1    ABHISHEK
2     SANTOSH
3        ASHA
4     CONTROL
5        OVER
dtype: object

In [17]:
arr1 + arr2

1    ABHISHEKABHISHEK
2      SANTOSHSANTOSH
3            ASHAASHA
4                 NaN
5                 NaN
dtype: object

# DATAFRAMES

In [18]:
import numpy as np

In [19]:
from numpy.random import randn

In [20]:
 np.random.seed(101)

In [21]:
df =pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [22]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [24]:
df['new'] = df['W']+df['Y']

In [25]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [26]:
df.drop('A',axis=0,inplace =True)

In [27]:
df.drop('new',axis=1,inplace=True)

In [28]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df.shape

(4, 4)

In [30]:
df[['W','X','Y']]

          W         X         Y
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [31]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [33]:
df.iloc[0]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [34]:
df.loc['C','Y']

0.5288134940893595

In [35]:
df.loc[['B','C'],['W','Y']]

          W         Y
B  0.651118 -0.848077
C -2.018168  0.528813

In [36]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df.reset_index()

  index         W         X         Y         Z
0     B  0.651118 -0.319318 -0.848077  0.605965
1     C -2.018168  0.740122  0.528813 -0.589001
2     D  0.188695 -0.758872 -0.933237  0.955057
3     E  0.190794  1.978757  2.605967  0.683509

In [38]:
newind = 'MH  GJ AM AP' .split()

In [39]:
newind

['MH', 'GJ', 'AM', 'AP']

In [40]:
df['states'] = newind

In [41]:
df

          W         X         Y         Z states
B  0.651118 -0.319318 -0.848077  0.605965     MH
C -2.018168  0.740122  0.528813 -0.589001     GJ
D  0.188695 -0.758872 -0.933237  0.955057     AM
E  0.190794  1.978757  2.605967  0.683509     AP

In [42]:
df.set_index('states', inplace=True)

In [43]:
df

               W         X         Y         Z
states
MH      0.651118 -0.319318 -0.848077  0.605965
GJ     -2.018168  0.740122  0.528813 -0.589001
AM      0.188695 -0.758872 -0.933237  0.955057
AP      0.190794  1.978757  2.605967  0.683509

In [54]:
df[df['W']>0] [['Y','X','Z']]

               Y         X         Z
states
MH     -0.848077 -0.319318  0.605965
AM     -0.933237 -0.758872  0.955057
AP      2.605967  1.978757  0.683509